app/Controllers/DashboardController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 28
---
    public function index()
{
    $clientId = session()->get('client_id');

    if (! $clientId) {
        return redirect()->to('/auth')->with('error', 'Veuillez vous connecter pour accéder à votre tableau de bord.');
    }

    $client = $this->clientModel->find($clientId);

SELECT *
FROM `clients`
WHERE `clients`.`id` = 28
---
    public function historique()
    {
        $clientId = session()->get('client_id');

        if (! $clientId) {
            return redirect()->to('/auth')->with('error', 'Veuillez vous connecter pour accéder à votre historique.');
        }

        $client = $this->clientModel->find($clientId);