app/Controllers/OperateurController.php

SELECT COUNT(*) AS `numrows`
FROM `clients`
SELECT COUNT(*) AS `numrows`
FROM `transactions`
---
    public function dashboard()
    {
        if (session()->get('operateur_role') !== 'operateur') {
            return redirect()->to('/operateur/auth')->with('error', 'Accès réservé aux opérateurs.');
        }

        $totalClients = $this->clientModel->countAllResults();
        $totalTransactions = $this->transactionModel->countAllResults();

SELECT *
FROM `clients`
ORDER BY `numero_telephone` ASC
---
    public function clients()
    {
        if (session()->get('operateur_role') !== 'operateur') {
            return redirect()->to('/operateur/auth')->with('error', 'Accès réservé aux opérateurs.');
        }

        $data = [
            'clients' => $this->clientModel->orderBy('numero_telephone', 'ASC')->findAll(),
        ];