app/Controllers/PrefixeController.php

SELECT *
FROM `prefixes`
ORDER BY `prefixe` ASC
---
    public function index()
    {
        $data = [
            'prefixes' => $this->prefixeModel->orderBy('prefixe', 'ASC')->findAll(),
        ];