app/Models/BaremeModel.php

    public function listeAvecTypeOperation(): array
    {
        return $this->select('baremes.*, types_operations.nom AS type_operation_nom')
            ->join('types_operations', 'types_operations.id = baremes.type_operation_id')
            ->orderBy('baremes.type_operation_id', 'ASC')
            ->orderBy('baremes.montant_min', 'ASC')
            ->findAll();
---
SELECT `baremes`.*, `types_operations`.`nom` AS `type_operation_nom`
FROM `baremes`
JOIN `types_operations` ON `types_operations`.`id` = `baremes`.`type_operation_id`
ORDER BY `baremes`.`type_operation_id` ASC, `baremes`.`montant_min` ASC