app/Models/ClientModel.php

    public function findByNumero(string $numero): ?array
    {
        return $this->where('numero_telephone', $numero)->first();
---
SELECT *
FROM `clients`
WHERE `numero_telephone` = '0381122334'
 LIMIT 1