app/Models/PrefixeModel.php

SELECT COUNT(*) AS `numrows`
FROM `prefixes`
WHERE `prefixe` = '038'
---
    public function estPrefixeValide(string $numero): bool
    {
        $prefixe = substr($numero, 0, 3);

        return $this->where('prefixe', $prefixe)->countAllResults() > 0;

SELECT COUNT(*) AS `numrows`
FROM `prefixes`
WHERE `prefixe` = '038'
AND `operateur_code` = 'MVOLA'
---
    public function estPrefixeMVola(string $numero): bool
    {
        $prefixe = substr($numero, 0, 3);

        return $this->where('prefixe', $prefixe)
            ->where('operateur_code', 'MVOLA')
            ->countAllResults() > 0;