app/Models/TransactionModel.php

    public function historiqueClient(int $clientId): array
    {
        return $this->select('
                transactions.*,
                types_operations.nom AS type_operation_nom,
                dest.numero_telephone AS destinataire_numero
            ')
            ->join('types_operations', 'types_operations.id = transactions.type_operation_id')
            ->join('clients AS dest', 'dest.id = transactions.client_destinataire_id', 'left')
            ->where('transactions.client_id', $clientId)
            ->orderBy('transactions.date_transaction', 'DESC')
            ->findAll();
---
SELECT `transactions`.*, `types_operations`.`nom` AS `type_operation_nom`, `dest`.`numero_telephone` AS `destinataire_numero`
FROM `transactions`
JOIN `types_operations` ON `types_operations`.`id` = `transactions`.`type_operation_id`
LEFT JOIN `clients` AS `dest` ON `dest`.`id` = `transactions`.`client_destinataire_id`
WHERE `transactions`.`client_id` = 28
ORDER BY `transactions`.`date_transaction` DESC